* Manual tests

#+begin_src R :async :session :results value
  Sys.sleep(2)
  2
#+end_src

#+RESULTS:
: 2

#+begin_src R :async
  Sys.sleep(1)
  2
#+end_src

#+RESULTS:
: 2

#+begin_src R
  Sys.sleep(1)
  2
#+end_src

#+RESULTS:
: 2

* TODO Automatic tests
